Catalogs/ЦелиРазвития.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЦелиРазвития</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МероприятияОбучения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЦелиРазвития/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыХарактеристики

&НаКлиенте
Процедура ХарактеристикиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		УстановитьОтборСтрокМероприятий(Элементы, Неопределено);
		Возврат;
	КонецЕсли;
	
	УстановитьОтборСтрокМероприятий(Элементы, ТекущиеДанные.Характеристика);
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикиПослеУдаления(Элемент)
	
	ХарактеристикиПослеУдаленияНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМероприятияОбучения

 &НаКлиенте
Процедура МероприятияОбученияПриИзменении(Элемент)
	
	ТекущиеДанныеМерпориятия = Элементы.МероприятияОбучения.ТекущиеДанные;
	Если ТекущиеДанныеМерпориятия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеХарактеристики = Элементы.Характеристики.ТекущиеДанные;
	Если ТекущиеДанныеХарактеристики = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанныеХарактеристики.Характеристика) Тогда
		ТекущиеДанныеМерпориятия.Характеристика = ТекущиеДанныеХарактеристики.Характеристика;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МероприятияОбученияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанныеХарактеристики = Элементы.Характеристики.ТекущиеДанные;
	Если ТекущиеДанныеХарактеристики = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Мероприятие Из ВыбранноеЗначение Цикл
		НайденныеСтроки = Объект.МероприятияОбучения.НайтиСтроки(Новый Структура("Мероприятие, Характеристика",
			Мероприятие, ТекущиеДанныеХарактеристики.Характеристика));
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.МероприятияОбучения.Добавить();
			НоваяСтрока.Мероприятие = Мероприятие;
			НоваяСтрока.Характеристика = ТекущиеДанныеХарактеристики.Характеристика;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборХарактеристик(Команда)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ДобавлятьЗначенияХарактеристик", Ложь);
	
	ХарактеристикиПерсоналаКлиент.ОткрытьФормуПодбораХарактеристик(ЭтотОбъект, ПараметрыПодбора,
		Новый ОписаниеОповещения("ДобавитьХарактеристикиПерсоналаНаКлиенте", ЭтотОбъект), "Значения");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьМероприятия(Команда)

	ТекущаяХарактеристика = Элементы.Характеристики.ТекущиеДанные;
	Если ТекущаяХарактеристика = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму("Справочник.МероприятияОбученияРазвития.ФормаВыбора", ПараметрыФормы, Элементы.МероприятияОбучения,
		УникальныйИдентификатор);

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере(ЗначениеКопирования = Неопределено)
	
	ХарактеристикиПерсоналаФормы.ЗаполнитьКартинкуИВидХарактеристикиТаблицыХарактеристик(Объект.Характеристики);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСтрокМероприятий(Элементы, Характеристика)
	
	СтруктураОтбора = Новый ФиксированнаяСтруктура("Характеристика", Характеристика);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "МероприятияОбучения", "ОтборСтрок",
		СтруктураОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьХарактеристикиПерсоналаНаКлиенте(НовыеХарактеристики, ДополнительныеПараметры = Неопределено) Экспорт
	
	ДобавитьХарактеристикиПерсоналаНаСервере(НовыеХарактеристики, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьХарактеристикиПерсоналаНаСервере(НовыеХарактеристики, ДополнительныеПараметры)
	
	ХарактеристикиПерсоналаФормы.ДобавитьХарактеристикиВТабличнуюЧасть(ЭтотОбъект, НовыеХарактеристики,
		ДополнительныеПараметры, "Объект.Характеристики");
		
КонецПроцедуры

&НаСервере
Процедура ХарактеристикиПослеУдаленияНаСервере()
	
	// Удалим мероприятия, связанные с удаленными характеристиками.
	
	Характеристики = Объект.Характеристики.Выгрузить(, "Характеристика");
	Характеристики.Индексы.Добавить("Характеристика");
	КоличествоМероприятий = Объект.МероприятияОбучения.Количество();
	Для Сч = 1 По КоличествоМероприятий Цикл
		СтрокаМероприятияОбучения = Объект.МероприятияОбучения.Получить(КоличествоМероприятий - Сч);
		Если Характеристики.Найти(СтрокаМероприятияОбучения.Характеристика, "Характеристика") = Неопределено Тогда
			Объект.МероприятияОбучения.Удалить(СтрокаМероприятияОбучения);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
